performance_scripts/refinement/Prompt_1/gpt_2/modify_user_preferences_performance_test_fixed_jmeter_5_6_3.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Modify User Preferences Performance Test - PATCH /api/v1/users/{user_id}/preferences">
      <stringProp name="TestPlan.comments">Validate partial updates to user preferences via PATCH /api/v1/users/{user_id}/preferences under concurrent load, ensuring p95 response time and error rate meet target</stringProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">BASE_PROTOCOL</stringProp>
            <stringProp name="Argument.value">http</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="BASE_HOST" elementType="Argument">
            <stringProp name="Argument.name">BASE_HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="BASE_PORT" elementType="Argument">
            <stringProp name="Argument.name">BASE_PORT</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="AUTH_TOKEN" elementType="Argument">
            <stringProp name="Argument.name">AUTH_TOKEN</stringProp>
            <stringProp name="Argument.value">eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJhZG1pbiIsImlhdCI6MTc3NjUwMTI1MCwiZXhwIjoxNzc2NTg3NjUwfQ.YxSXaZBmBUgEtDY0-azzDJqtdv4J59AOt2SazwetZz4</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="USER_IDS" elementType="Argument">
            <stringProp name="Argument.name">USER_IDS</stringProp>
            <stringProp name="Argument.value">189060,189061,189062,189063,189064,189065,189066,189067,189068,189069,189070,189071,189072,189073,189074,189075,189076,189077,189078,189079,189080,189081,189082,189083,189084,189085,189086,189087,189088,189089,189090,189091,189092,189093,189094,189095,189096,189097,189098,189099,189100,189101,189102,189103,189104,189105,189106,189107,189108,189109</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TARGET_USERS" elementType="Argument">
            <stringProp name="Argument.name">TARGET_USERS</stringProp>
            <stringProp name="Argument.value">50</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TEST_DURATION_SECONDS" elementType="Argument">
            <stringProp name="Argument.name">TEST_DURATION_SECONDS</stringProp>
            <stringProp name="Argument.value">300</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="Setup - Initialize Metrics">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Initialize Global Metrics" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">
import java.util.concurrent.ConcurrentLinkedQueue
import java.util.concurrent.atomic.AtomicLong
import java.util.concurrent.atomic.LongAdder

props.put(&apos;patch.total&apos;, new LongAdder())
props.put(&apos;patch.errors&apos;, new LongAdder())
props.put(&apos;patch.times&apos;, new ConcurrentLinkedQueue&lt;Long&gt;())
props.put(&apos;patch.firstSampleTs&apos;, new AtomicLong(0L))
props.put(&apos;patch.lastSampleTs&apos;, new AtomicLong(0L))
props.put(&apos;patch.consistency.total&apos;, new LongAdder())
props.put(&apos;patch.consistency.errors&apos;, new LongAdder())

SampleResult.setSuccessful(true)
SampleResult.setResponseCode(&apos;200&apos;)
SampleResult.setResponseMessage(&apos;Metrics initialized&apos;)
          </stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Static Load - 50 Concurrent PATCH Operations for 300s">
        <stringProp name="ThreadGroup.num_threads">${TARGET_USERS}</stringProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <stringProp name="ThreadGroup.duration">${TEST_DURATION_SECONDS}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <stringProp name="HTTPSampler.domain">${BASE_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${BASE_PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Authorization" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${AUTH_TOKEN}</stringProp>
            </elementProp>
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="Accept" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="Cookie Manager" enabled="true">
          <collectionProp name="CookieManager.cookies"/>
          <boolProp name="CookieManager.clearEachIteration">false</boolProp>
          <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
        </CookieManager>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Prepare Preference Update Data" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">
def ids = vars.get(&apos;USER_IDS&apos;).split(&apos;,&apos;).collect { it.trim() }.findAll { it }
if (ids.isEmpty()) {
    throw new IllegalStateException(&apos;USER_IDS must contain at least one pre-created user_id&apos;)
}
def userId = ids[ctx.getThreadNum() % ids.size()]
vars.put(&apos;user_id&apos;, userId)
vars.put(&apos;pref_email_notifications&apos;, &apos;false&apos;)
vars.put(&apos;pref_language&apos;, &apos;fr&apos;)
          </stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="PATCH /api/v1/users/{user_id}/preferences" enabled="true">
          <stringProp name="HTTPSampler.path">/api/v1/users/${user_id}/preferences</stringProp>
          <stringProp name="HTTPSampler.method">PATCH</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;email_notifications&quot;: ${pref_email_notifications},&#xd;
  &quot;language&quot;: &quot;${pref_language}&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Assert PATCH 2xx Response" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">
def rc = prev.getResponseCode()
if (!(rc ==~ /2\\d\\d/)) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage(&quot;Expected HTTP 2xx for PATCH but got ${rc}&quot;)
}
            </stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Aggregate PATCH Metrics" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">
import java.util.concurrent.atomic.AtomicLong
import java.util.concurrent.atomic.LongAdder

LongAdder total = props.get(&apos;patch.total&apos;) as LongAdder
LongAdder errors = props.get(&apos;patch.errors&apos;) as LongAdder
def times = props.get(&apos;patch.times&apos;)
AtomicLong firstTs = props.get(&apos;patch.firstSampleTs&apos;) as AtomicLong
AtomicLong lastTs = props.get(&apos;patch.lastSampleTs&apos;) as AtomicLong

long sampleStart = prev.getStartTime()
long sampleEnd = prev.getEndTime()

total.increment()
if (!prev.isSuccessful()) {
    errors.increment()
}
times.add(prev.getTime() as Long)

while (true) {
    long cur = firstTs.get()
    if (cur != 0L &amp;&amp; cur &lt;= sampleStart) {
        break
    }
    if (firstTs.compareAndSet(cur, sampleStart)) {
        break
    }
}

while (true) {
    long cur = lastTs.get()
    if (cur &gt;= sampleEnd) {
        break
    }
    if (lastTs.compareAndSet(cur, sampleEnd)) {
        break
    }
}
            </stringProp>
          </JSR223PostProcessor>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">if (!prev.isSuccessful()) {
    log.info(&quot;PATCH failed: code=&quot; + prev.getResponseCode() + &quot;, message=&quot; + prev.getResponseMessage())
    log.info(&quot;Response body: &quot; + prev.getResponseDataAsString())
}</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup" testname="TearDown - Validate NFRs">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </PostThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Evaluate PATCH NFRs" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import java.util.concurrent.atomic.LongAdder

LongAdder total = props.get(&apos;patch.total&apos;) as LongAdder
LongAdder errors = props.get(&apos;patch.errors&apos;) as LongAdder
def queue = props.get(&apos;patch.times&apos;)

long totalCount = total != null ? total.sum() : 0L
long errorCount = errors != null ? errors.sum() : 0L

def times = []
if (queue != null) {
    times.addAll(queue)
}
Collections.sort(times)

long p95 = 0L
if (times.size() &gt; 0) {
    int index = Math.ceil(times.size() * 0.95d) as int
    index = Math.max(1, index) - 1
    p95 = (times[index] as Number).longValue()
}

double errorRate = totalCount &gt; 0 ? (errorCount * 100.0d / totalCount) : 100.0d
boolean p95Pass = p95 &lt;= 400L
boolean errorPass = errorRate &lt; 1.0d

def summary = &quot;NFR Evaluation Summary\n&quot; +
&quot;patch_total_samples=${totalCount}\n&quot; +
&quot;patch_error_count=${errorCount}\n&quot; +
&quot;patch_error_rate_pct=${String.format(&apos;%.4f&apos;, errorRate)}\n&quot; +
&quot;patch_p95_ms=${p95}\n&quot; +
&quot;threshold_patch_p95_ms&lt;=400 =&gt; ${p95Pass}\n&quot; +
&quot;threshold_patch_error_rate_pct&lt;1 =&gt; ${errorPass}\n&quot;

SampleResult.setResponseData(summary, &apos;UTF-8&apos;)

if (totalCount == 0L) {
    SampleResult.setSuccessful(false)
    SampleResult.setResponseCode(&apos;500&apos;)
    SampleResult.setResponseMessage(&apos;No PATCH samples were collected&apos;)
    throw new AssertionError(&apos;No PATCH samples were collected for /api/v1/users/{user_id}/preferences&apos;)
}

if (!(p95Pass &amp;&amp; errorPass)) {
    SampleResult.setSuccessful(false)
    SampleResult.setResponseCode(&apos;500&apos;)
    SampleResult.setResponseMessage(&apos;NFR validation failed&apos;)
    throw new AssertionError(summary)
}

SampleResult.setSuccessful(true)
SampleResult.setResponseCode(&apos;200&apos;)
SampleResult.setResponseMessage(&apos;All NFR thresholds passed&apos;)
log.info(summary)</stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>